# Exercises for Lecture 2 (Data wrangling with Pandas)

In [1]:
import datetime
now = datetime.datetime.now()
print("Last executed: " + now.strftime("%Y-%m-%d %H:%M:%S"))

Last executed: 2021-01-21 15:26:39

In [2]:
import pandas as pd
import numpy as np

## Exercise 1: Data selection

In [3]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'population':pop})
data

              area  population
California  423967    38332521
Texas       695662    26448193
New York    141297    19651127
Florida     170312    19552860
Illinois    149995    12882135

Create a `DataFrame` containing only those states that have an area greater than 150,000 and a population greater than 20 million.

In [8]:
data[(data.area>150000) & (data.population>20e6)]

              area  population
California  423967    38332521
Texas       695662    26448193

## Exercise 2: Operating on data in Pandas
Consider the following two series.

In [9]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

Compute the population density for each state (where possible).

In [15]:
pop = pd.DataFrame()
pop['area']= area
pop['population'] = population
pop['density'] = pop.population/pop.area
pop

               area  population    density
Alaska      1723337         NaN        NaN
Texas        695662  26448193.0  38.018740
California   423967  38332521.0  90.413926

## Exercise 3: Detecting null values

Consider the following series.

In [16]:
data = pd.Series([1, np.nan, 'hello', np.nan])
data

0        1
1      NaN
2    hello
3      NaN
dtype: object

Compute a new Series of bools that specify whether each entry in the above Series is *not* NaN.  Using this Series, construct a new series from the original data that does not contain the NaN entries.

In [20]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

### Exercise 4: Remove null values directly

Remove null values from the previous data `Series` directly.

In [25]:
data = data.dropna()
data

0        1
2    hello
dtype: object

In [26]:
data = pd.Series([1, np.nan, 'hello', np.nan])
data1= pd.DataFrame()
data1['data'] = data
data1.dropna()

    data
0      1
2  hello